Repository: common-repository/wc-cryptum-checkout
Catalog: languages/cryptum-checkout-*.po
Languages: pt_br

source: Connects your WooCommerce store to the Cryptum Checkout Payment Gateway.
pt_br: Conectar sua loja WooCommerce ao Cryptum Checkout.

source: Pay with Cryptum, you will be redirected to Cryptum Checkout to finish your order payment
pt_br: Pague com Cryptum Checkout, você será redirecionado ao Cryptum Checkout para finalizar seu pagamento

source: Store wallets not configured yet. You must configure the wallets in Cryptum dashboard first
pt_br: As carteiras da loja não foram configuradas ainda. Vá até o portal do Cryptum para configurar as carteiras

source: Store not configured yet or not existent. You must configure a store in Cryptum dashboard first
pt_br: A loja não foi configurada corretamente ou não existe. Vá até o portal do Cryptum para configurar uma loja

source: Webhook secret is incorrect. Try to copy it from Cryptum dashboard
pt_br: A chave secreta do webhook está incorreta. Tente copiá-la do portal do Cryptum

source: Enable/Disable
pt_br: Habilitar/Desabilitar

source: Enable Cryptum E-commerce Checkout
pt_br: Habilitar Cryptum Checkout

source: Title
pt_br: Título

source: This controls the title which the user sees during checkout.
pt_br: Isso controla o título que os usuários verão durante o pagamento.

source: Environment
pt_br: Ambiente

source: Choose your environment. The Test environment should be used for testing only.
pt_br: Selecione um ambiente. O ambiente de Teste deve ser usado para testnet.

source: Production
pt_br: Produção (mainnet)

source: Test
pt_br: Teste (testnet)

source: Store ID
pt_br: ID de Loja

source: Enter your Cryptum Checkout Store ID (Automatically Generated in Cryptum Dashboard, Project Section.)
pt_br: Insira o ID de Loja (Gerado automaticamente no portal do Cryptum, Seção de Projeto.)

source: API Key
pt_br: Chave de API

source: Enter your Cryptum API Key (Generated in Cryptum Dashboard, Project Section)
pt_br: Insira sua chave de API (Gerada no portal do Cryptum, Seção de Projeto)

source: Webhook Secret Key
pt_br: Chave secreta de webhook

source: <b>Optional</b>. Enter your Webhook secret key (Generated in Cryptum Dashboard, Webhooks Section)
pt_br: <b>Opcional</b>. Insira sua chave de API (Gerada no portal do Cryptum, Seção de Webhooks)

source: Store Markup Percentage
pt_br: Porcentagem de aumento de preço

source: Enter your percentage markup value
pt_br: Insira a porcentagem para aumento de preço

source: Store Discount Percentage
pt_br: Porcentagem de desconto de preço

source: Enter your percentage discount value
pt_br: Insira a porcentagem para desconto de preço

source: Cryptum Checkout Transactions Info
pt_br: Informações de transações do Cryptum Checkout

source: Blockchain Info
pt_br: Informação de blockchain

source: No transactions yet.
pt_br: Sem transações ainda.

source: Unsupported currency:
pt_br: Moeda não suportada:

source: Error processing Cryptum Checkout
pt_br: Erro ao processar pedido

source: Pending Cryptum Checkout payment
pt_br: Pagamento pendente do Cryptum Checkout

source: No signatures found matching the expected signature
pt_br: Assinaturas são incompatíveis

source: Payment callback received for non-existent order ID
pt_br: Callback de pagamento recebido com ID de pedido inexistente

source: Payment was successful
pt_br: Pagamento foi finalizado com sucesso

source: Successful payment
pt_br: Pagamento finalizado com sucesso

source: Failed to update order status
pt_br: Falha ao atualizar o status do pedido

source: Payment was cancelled
pt_br: Pagamento foi cancelado

source: Cancelled payment
pt_br: Pagamento cancelado

source: Payment awaiting to complete
pt_br: Pagamento está sendo finalizado

source: Payment failed
pt_br: Pagamento falhou

source: Invalid order
pt_br: Pedido inválido

source: Cryptum Checkout Plugin needs Woocommerce enabled to work correctly. Please install and/or enable Woocommerce plugin
pt_br: O plugin Cryptum Checkout requer WooCommerce habilitado para funcionar corretamente. Por favor instalar e/ou habilitá-lo.

source: Configure
pt_br: Configurar
